In [1]:
import pandas as pd
import numpy as np

In [2]:
sales = [{'account': 'Jones LLC','type':'a', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co','type':'b',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc','type':'a',  'Jan': 50,  'Feb': 90,  'Mar': 95 }]

In [3]:
df = pd.DataFrame(sales)

In [4]:
df.groupby('type')

In [5]:
df.groupby('type').count()

      account  Jan  Feb  Mar
type
a           2    2    2    2
b           1    1    1    1

In [6]:
df.groupby('type').groups

{'a': Int64Index([0, 2], dtype='int64'), 'b': Int64Index([1], dtype='int64')}

In [7]:
for a,b in df.groupby('type'):
    print(a)
    print(b)

a
     account type  Jan  Feb  Mar
0  Jones LLC    a  150  200  140
2   Blue Inc    a   50   90   95
b
    account type  Jan  Feb  Mar
1  Alpha Co    b  200  210  215

In [8]:
df

     account type  Jan  Feb  Mar
0  Jones LLC    a  150  200  140
1   Alpha Co    b  200  210  215
2   Blue Inc    a   50   90   95

In [9]:
df.groupby('type')['Jan'].mean()

type
a    100
b    200
Name: Jan, dtype: int64

In [10]:
df.groupby('type').aggregate({'type':'count','Feb':'sum'})

      type  Feb
type
a        2  290
b        1  210